bungcip.better-toml
eamodio.gitlens
foxundermoon.shell-format
matangover.mypy
ms-azuretools.vscode-docker
ms-python.anaconda-extension-pack
ms-python.python
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-ssh-explorer
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.cpptools
ms-vscode.Go
pycom.pymakr
redhat.vscode-yaml
rust-lang.rust
vsciot-vscode.vscode-arduino
xyz.local-history
