bungcip.better-toml
eamodio.gitlens
foxundermoon.shell-format
matangover.mypy
ms-azuretools.vscode-docker
ms-python.anaconda-extension-pack
ms-python.python
ms-vscode.cpptools
ms-vscode.Go
redhat.vscode-yaml
rust-lang.rust
vsciot-vscode.vscode-arduino
xyz.local-history
